app/views/teams/show.html.erb

  <%# print out the names of teammembers %>
     <%User.where(id: m.user_id).each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]