app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "first survey"], ["created_at", "2022-04-17 20:53:48.078435"], ["updated_at", "2022-04-17 20:53:48.078435"]]

  def destroy
    Project.find(params[:id]).destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]