app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "team blue"], ["created_at", "2022-04-17 18:50:49.308187"], ["updated_at", "2022-04-17 18:50:49.308187"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
  	TeamMembership.where(team_id: params[:id]).each do |m|
  		m.destroy
  	end
    Team.find(params[:id]).destroy