app/controllers/team_memberships_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @users = Student.all

SELECT "users".* FROM "users"
---
  def new
    @@team_id = params[:team_id] unless defined? @@team_id
    @users = User.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

    @team = Team.find(params[:id])