app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["name", "s"], ["updated_at", "2022-04-16 15:38:20.336458"], ["password_digest", "$2a$12$1qVvTO5DSdWXHNDsFnF4qO1r08TWdJDvKzYYIxlnoOwZdt4KBiYwK"], ["id", 1]]
---
   def update
    @user = User.find(params[:id])
    if @user.update(user_params)