app/views/team_memberships/_form.html.erb

  <%j=Array.new %>
  <%users=User.all%>
---
SELECT "users".* FROM "users"