app/views/team_memberships/new.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
<h1>Add Student to <%= Team.find(@team_id).name.capitalize %></h1>