app/views/layouts/_header.html.erb

SELECT "team_memberships".* FROM "team_memberships" WHERE "team_memberships"."user_id" = ? LIMIT ?  [["user_id", 950961013], ["LIMIT", 1]]
---
          <% else %>
          	<% if TeamMembership.find_by(user_id: current_user.id) %>